
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Основание = Основание;
	Движение.ВидАтракциона = ПолучитьВидАтракциона(Атракцион);
	Движение.КоличествоПосещений = 1;
	
	Движения.Записать();
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктивныеПосещенияОстатки.Основание КАК Основание
		|ИЗ
		|	РегистрНакопления.АктивныеПосещения.Остатки(, Основание = &Основание) КАК АктивныеПосещенияОстатки
		|ГДЕ
		|	АктивныеПосещенияОстатки.КоличествоПосещенийОстаток < 0";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Сообщение =  Новый СообщениеПользователю();
		Сообщение.Текст = "Нельзя по одному билету проходить дважды";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Основание";
		Сообщение.Сообщить();		
	КонецЕсли;	
	


КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


Функция ПолучитьВидАтракциона(ТекАтракцион)
	
	ТекВидАтракциона = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Атракционы.ВидАтракциона КАК ВидАтракциона
		|ИЗ
		|	Справочник.Атракционы КАК Атракционы
		|ГДЕ
		|	Атракционы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекАтракцион);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
	
		ТекВидАтракциона = ВыборкаДетальныеЗаписи.ВидАтракциона;

	КонецЕсли;
	
	Возврат ТекВидАтракциона;
		
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
