
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)


	Если ВидНоменклатуры <> Перечисления.ВидНоменклатуры.ПосещениеАтракциона Тогда
		НомерУдаление = ПроверяемыеРеквизиты.Найти("КоличествоПосещений");
		Если НомерУдаление <> Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(НомерУдаление);
		КонецЕсли;
	КонецЕсли;


КонецПроцедуры
#КонецОбласти



#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
