
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостьюЭлементов();

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	УправлениеВидимостьюЭлементов();

КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УправлениеВидимостьюЭлементов()
	
	ЭтоПосещениеАтракциона = (Объект.ВидНоменклатуры = Перечисления.ВидНоменклатуры.ПосещениеАтракциона);
	
	Элементы.ВидАтракциона.Видимость = ЭтоПосещениеАтракциона;
	Элементы.КоличествоПосещений.Видимость = ЭтоПосещениеАтракциона;
	
КонецФункции	

#КонецОбласти
