
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	СвойстваНоменклатуры = ПолучитьСвойстваНоменклатуры(Номенклатура);
	
	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Основание = Ссылка;
	Движение.ВидАтракциона = СвойстваНоменклатуры.ВидАтракциона;
	Движение.КоличествоПосещений = СвойстваНоменклатуры.КоличествоПосещений;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.ВидАтракциона = СвойстваНоменклатуры.ВидАтракциона;
	Движение.Сумма = СуммаДокумента;

КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьСвойстваНоменклатуры(ТекНоменклатура)
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	
	ДанныеНоменклатуры = Новый Структура;
	ДанныеНоменклатуры.Вставить("ВидАтракциона");
	ДанныеНоменклатуры.Вставить("КоличествоПосещений");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.КоличествоПосещений КАК КоличествоПосещений,
		|	Номенклатура.ВидАтракциона КАК ВидАтракциона
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ТекНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ДанныеНоменклатуры.ВидАтракциона = ВыборкаДетальныеЗаписи.ВидАтракциона;
		ДанныеНоменклатуры.КоличествоПосещений = ВыборкаДетальныеЗаписи.КоличествоПосещений;

	КонецЕсли;
	
	Возврат ДанныеНоменклатуры;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
